import React from 'react';

const PrivacyPolicy: React.FC = () => {
    return (
        <div className="prose prose-slate dark:prose-invert max-w-none text-slate-600 dark:text-slate-400">
            <p>ဤကိုယ်ရေးကိုယ်တာ မူဝါဒသည် ကျွန်ုပ်တို့၏ ဝဘ်ဆိုဒ်ကို သင်အသုံးပြုသည့်အခါ သင့်အချက်အလက်များကို ကျွန်ုပ်တို့ မည်သို့ စုဆောင်း၊ အသုံးပြု၊ ထုတ်ဖော်ပုံကို ဖော်ပြပါသည်။</p>

            <h4>၁။ ကျွန်ုပ်တို့ စုဆောင်းသော အချက်အလက်များ</h4>
            <p>ကျွန်ုပ်တို့သည် သင်၏ အမည်၊ အီးမေးလ်လိပ်စာကဲ့သို့သော ကိုယ်ရေးကိုယ်တာ အချက်အလက်များကို သင်ဆန္ဒအလျောက် ပေးအပ်သည့်အခါ စုဆောင်းနိုင်ပါသည်။ ဝဘ်ဆိုဒ်အသုံးပြုမှုဆိုင်ရာ အချက်အလက်များကိုလည်း အလိုအလျောက် စုဆောင်းပါသည်။</p>

            <h4>၂။ အချက်အလက်များကို မည်သို့အသုံးပြုသနည်း</h4>
            <p>သင်၏ အချက်အလက်များကို ကျွန်ုပ်တို့၏ ဝန်ဆောင်မှုများ ပေးအပ်ရန်၊ တိုးတက်စေရန်၊ သင်နှင့် ဆက်သွယ်ရန်နှင့် ကျွန်ုပ်တို့၏ ဝဘ်ဆိုဒ်ကို စိတ်ကြိုက်ပြင်ဆင်ရန် အသုံးပြုပါသည်။</p>

            <h4>၃။ အချက်အလက် မျှဝေခြင်း</h4>
            <p>ဥပဒေအရ လိုအပ်ခြင်း သို့မဟုတ် ကျွန်ုပ်တို့၏ လုပ်ငန်းလည်ပတ်မှုကို ကူညီပေးသော တတိယပုဂ္ဂိုလ် ဝန်ဆောင်မှုပေးသူများမှလွဲ၍ သင်၏ ကိုယ်ရေးကိုယ်တာ အချက်အလက်များကို ကျွန်ုပ်တို့သည် ရောင်းချခြင်း၊ ရောင်းဝယ်ခြင်း သို့မဟုတ် ငှားရမ်းခြင်း မပြုပါ။</p>

            <h4>၄။ လုံခြုံရေး</h4>
            <p>သင်၏ ကိုယ်ရေးကိုယ်တာ အချက်အလက်များ၏ လုံခြုံရေးကို ကာကွယ်ရန် ကျွန်ုပ်တို့သည် ကျိုးကြောင်းဆီလျော်သော အစီအမံများ ပြုလုပ်ထားသော်လည်း အင်တာနက်ပေါ်တွင် ၁၀၀% လုံခြုံသော နည်းလမ်းမရှိပါ။</p>
        </div>
    );
};

export default PrivacyPolicy;
